#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]
#![allow(non_snake_case)]

use std::ffi::{ CString, CStr };

#[doc = " Event types"]
pub const projectMEvent_PROJECTM_KEYUP: projectMEvent = 0;
#[doc = " Event types"]
pub const projectMEvent_PROJECTM_KEYDOWN: projectMEvent = 1;
#[doc = " Event types"]
pub const projectMEvent_PROJECTM_VIDEORESIZE: projectMEvent = 2;
#[doc = " Event types"]
pub const projectMEvent_PROJECTM_VIDEOQUIT: projectMEvent = 3;
pub type projectMEvent = u32;
#[doc = " Keycodes"]
pub const projectMKeycode_PROJECTM_K_RETURN: projectMKeycode = 0;
#[doc = " Keycodes"]
pub const projectMKeycode_PROJECTM_K_RIGHT: projectMKeycode = 1;
#[doc = " Keycodes"]
pub const projectMKeycode_PROJECTM_K_LEFT: projectMKeycode = 2;
#[doc = " Keycodes"]
pub const projectMKeycode_PROJECTM_K_UP: projectMKeycode = 3;
#[doc = " Keycodes"]
pub const projectMKeycode_PROJECTM_K_DOWN: projectMKeycode = 4;
#[doc = " Keycodes"]
pub const projectMKeycode_PROJECTM_K_PAGEUP: projectMKeycode = 5;
#[doc = " Keycodes"]
pub const projectMKeycode_PROJECTM_K_PAGEDOWN: projectMKeycode = 6;
#[doc = " Keycodes"]
pub const projectMKeycode_PROJECTM_K_INSERT: projectMKeycode = 7;
#[doc = " Keycodes"]
pub const projectMKeycode_PROJECTM_K_DELETE: projectMKeycode = 8;
#[doc = " Keycodes"]
pub const projectMKeycode_PROJECTM_K_ESCAPE: projectMKeycode = 9;
#[doc = " Keycodes"]
pub const projectMKeycode_PROJECTM_K_LSHIFT: projectMKeycode = 10;
#[doc = " Keycodes"]

#[doc = " internally instead of using the default configuration file.</p>"]
#[doc = ""]
#[doc = " <p>Always allocate the struct using the projectm_alloc_settings() and free it with the projectm_free_settings()"]
#[doc = " function.</p>"]
#[doc = ""]
#[doc = " <p>To allocate memory for char* members, always use projectm_alloc_string(). If any pointer is not NULL,"]
#[doc = " projectm_free_settings() will automatically call projectm_free_string() on it. If you free it on your own, remember"]
#[doc = " to reset the pointer to NULL after doing so!</p>"]

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct projectm_settings_s {
    #[doc = "!< Per-pixel mesh X resolution."]
    pub mesh_x: i32,
    #[doc = "!< Per-pixel mesh Y resolution."]
    pub mesh_y: i32,
    #[doc = "!< Target rendering frames per second."]
    pub fps: i32,
    #[doc = "!< Size of the render texture. Must be a power of 2."]
    pub texture_size: i32,
    #[doc = "!< Width of the rendering viewport."]
    pub window_width: i32,
    #[doc = "!< Height of the rendering viewport."]
    pub window_height: i32,
    #[doc = "!< Path to a preset playlist in XML format to be loaded. Use FLAG_DISABLE_PLAYLIST_LOAD to skip loading a playlist."]
    pub preset_url: *mut ::std::os::raw::c_char,
    #[doc = "!< Path to the \"title\" font that is used to render the preset name."]
    pub title_font_url: *mut ::std::os::raw::c_char,
    #[doc = "!< Path to the \"menu\" font that is used to render the built-in on-screen menu."]
    pub menu_font_url: *mut ::std::os::raw::c_char,
    #[doc = "!< Path to data files like default fonts and presets."]
    pub data_dir: *mut ::std::os::raw::c_char,
    #[doc = "!< Display duration for each preset in seconds."]
    pub preset_duration: f64,
    #[doc = "!< Blend-over duration between two presets in seconds."]
    pub soft_cut_duration: f64,
    #[doc = "!< Minimum time in seconds a preset is displayed before a hard cut can happen."]
    pub hard_cut_duration: f64,
    #[doc = "!< Set to true to enable fast beat-driven preset switches."]
    pub hard_cut_enabled: bool,
    #[doc = "!< Beat sensitivity value that must be surpassed for a hard cut."]
    pub hard_cut_sensitivity: f32,
    #[doc = "!< Beat sensitivity. Standard sensitivity is 1.0."]
    pub beat_sensitivity: f32,
    #[doc = "!< Use aspect ration correction in presets that support it."]
    pub aspect_correction: bool,
    #[doc = "!< Used as the \"sigma\" value for a gaussian RNG to randomize preset duration. Unused on Windows."]
    pub easter_egg: f32,
    #[doc = "!< Enable playlist shuffle, selecting a random preset on each switch instead of the next in list."]
    pub shuffle_enabled: bool,
    #[doc = "!< If true, use soft cut ratings on soft cuts and hard cut ratings on hard cuts. If false, the hard cut rating is always used."]
    pub soft_cut_ratings_enabled: bool,
}
#[test]
fn bindgen_test_layout_projectm_settings_s() {
    assert_eq!(
        ::std::mem::size_of::<projectm_settings_s>(),
        104usize,
        concat!("Size of: ", stringify!(projectm_settings_s))
    );
    assert_eq!(
        ::std::mem::align_of::<projectm_settings_s>(),
        8usize,
        concat!("Alignment of ", stringify!(projectm_settings_s))
    );
    fn test_field_mesh_x() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mesh_x) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(mesh_x)
            )
        );
    }
    test_field_mesh_x();
    fn test_field_mesh_y() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mesh_y) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(mesh_y)
            )
        );
    }
    test_field_mesh_y();
    fn test_field_fps() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).fps) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(fps)
            )
        );
    }
    test_field_fps();
    fn test_field_texture_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).texture_size) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(texture_size)
            )
        );
    }
    test_field_texture_size();
    fn test_field_window_width() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).window_width) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(window_width)
            )
        );
    }
    test_field_window_width();
    fn test_field_window_height() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).window_height) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(window_height)
            )
        );
    }
    test_field_window_height();
    fn test_field_preset_url() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).preset_url) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(preset_url)
            )
        );
    }
    test_field_preset_url();
    fn test_field_title_font_url() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).title_font_url) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(title_font_url)
            )
        );
    }
    test_field_title_font_url();
    fn test_field_menu_font_url() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).menu_font_url) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(menu_font_url)
            )
        );
    }
    test_field_menu_font_url();
    fn test_field_data_dir() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).data_dir) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(data_dir)
            )
        );
    }
    test_field_data_dir();
    fn test_field_preset_duration() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).preset_duration) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(preset_duration)
            )
        );
    }
    test_field_preset_duration();
    fn test_field_soft_cut_duration() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).soft_cut_duration) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(soft_cut_duration)
            )
        );
    }
    test_field_soft_cut_duration();
    fn test_field_hard_cut_duration() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).hard_cut_duration) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(hard_cut_duration)
            )
        );
    }
    test_field_hard_cut_duration();
    fn test_field_hard_cut_enabled() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).hard_cut_enabled) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(hard_cut_enabled)
            )
        );
    }
    test_field_hard_cut_enabled();
    fn test_field_hard_cut_sensitivity() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).hard_cut_sensitivity) as usize - ptr as usize
            },
            84usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(hard_cut_sensitivity)
            )
        );
    }
    test_field_hard_cut_sensitivity();
    fn test_field_beat_sensitivity() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).beat_sensitivity) as usize - ptr as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(beat_sensitivity)
            )
        );
    }
    test_field_beat_sensitivity();
    fn test_field_aspect_correction() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).aspect_correction) as usize - ptr as usize
            },
            92usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(aspect_correction)
            )
        );
    }
    test_field_aspect_correction();
    fn test_field_easter_egg() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).easter_egg) as usize - ptr as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(easter_egg)
            )
        );
    }
    test_field_easter_egg();
    fn test_field_shuffle_enabled() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shuffle_enabled) as usize - ptr as usize
            },
            100usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(shuffle_enabled)
            )
        );
    }
    test_field_shuffle_enabled();
    fn test_field_soft_cut_ratings_enabled() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).soft_cut_ratings_enabled) as usize - ptr as usize
            },
            101usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(soft_cut_ratings_enabled)
            )
        );
    }
    test_field_soft_cut_ratings_enabled();
}
#[doc = " @brief projectM instance settings."]
#[doc = ""]
#[doc = " <p>Use this struct to provide settings for projectM, for example if your application handles projectM configuration"]
#[doc = " internally instead of using the default configuration file.</p>"]
#[doc = ""]
#[doc = " <p>Always allocate the struct using the projectm_alloc_settings() and free it with the projectm_free_settings()"]
#[doc = " function.</p>"]
#[doc = ""]
#[doc = " <p>To allocate memory for char* members, always use projectm_alloc_string(). If any pointer is not NULL,"]
#[doc = " projectm_free_settings() will automatically call projectm_free_string() on it. If you free it on your own, remember"]
#[doc = " to reset the pointer to NULL after doing so!</p>"]
